<a href="https://colab.research.google.com/github/nikhilveldanda/INFO-5731/blob/Assignment1/INFO5731_Assignment_One.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **INFO5731 Assignment One**

# Question 1

(20 points). Write a Python program to generate 12 random numbers between 1 and 100. Sort the list of numbers in ascending order and print it out. Sort the list of numbers in descending order and print it out. Calculate the average for the group and print it out.

In [6]:
import random
l1=[]
for i in range(12):
  l1.append(random.randint(1,100))
print("Ascending Order", sorted(l1))
print("Descending Order",sorted(l1,reverse=True))
print("Average",sum(l1)/len(l1))

Ascending Order [15, 21, 23, 35, 38, 41, 48, 49, 49, 53, 84, 95]
Descending Order [95, 84, 53, 49, 49, 48, 41, 38, 35, 23, 21, 15]
Average 45.916666666666664

# Question 2
(25 points). Write a program that will do the following string formatting tasks:

(1) Ask the user to enter two sentences.

(2) Make each sentence into a list. Each element in the list should correspond to a word in the sentence. For example, if the sentence is "Alas! Am I alive? This is my first python program", the program should print out ['Alas, '!', 'Am', 'I', 'alive, '?', 'This', 'is', 'my', 'first', 'python', 'program'].

(3) Compare the two sentences. Print out a list of words that occur in both sentences.

(4) Remove any punctuation from the sentence and print it back out. It should remove at least the following characters, but it can remove more: period(“.”), comma (“,”), semicolon (“;”), and colon (“:”)

(5) Count the number of vowels in the sentences. Print out each vowel and the number of times it appears in the sentences, such as: a:2, e:1, i:0, etc

In [45]:
# Your code here
import re
#1
print("#1")
st1 = input("Enter sentence 1 ")
st2 = input("Enter sentence 2 ")
print("\n")
#2
print("#2")
s1 = (re.findall(r"[\w']+|[.,!?;]", st1))
s2 = (re.findall(r"[\w']+|[.,!?;]", st2))

print(s1 + s2)
print("\n")
#3
print("#3")
print("Two sentences comparision list ",list(set(s1).intersection(set(s2))))
print("\n")
#4
print("#4")
removed_punc_st1 = "".join([i for i in st1 if i not in ".,;:'/?!"])
removed_punc_st2 = "".join([i for i in st2 if i not in ".,;:'/?!"])

print("sentence 1 with removed punctuation:",removed_punc_st1)
print("sentence 2 with removed punctuation:",removed_punc_st2)
print("\n")
#5
print("#5")
vowels_st1 = {}
vowels_st1["a"] = st1.lower().count("a")
vowels_st1["e"] = st1.lower().count("e")
vowels_st1["i"] = st1.lower().count("i")
vowels_st1["o"] = st1.lower().count("o")
vowels_st1["u"] = st1.lower().count("u")
print("Vowels count in sentence 1",vowels_st1)

vowels_st2 = {}
vowels_st2["a"] = st2.lower().count("a")
vowels_st2["e"] = st2.lower().count("e")
vowels_st2["i"] = st2.lower().count("i")
vowels_st2["o"] = st2.lower().count("o")
vowels_st2["u"] = st2.lower().count("u")
print("Vowels count in sentence 2",vowels_st2)

#1
Enter sentence 1 Alas! Am I alive?
Enter sentence 2 This is my first python program. Alas!


#2
['Alas', '!', 'Am', 'I', 'alive', '?', 'This', 'is', 'my', 'first', 'python', 'program', '.', 'Alas', '!']


#3
Two sentences comparision list  ['Alas', '!']


#4
sentence 1 with removed punctuation: Alas Am I alive
sentence 2 with removed punctuation: This is my first python program Alas


#5
Vowels count in sentence 1 {'a': 4, 'e': 1, 'i': 2, 'o': 0, 'u': 0}
Vowels count in sentence 2 {'a': 3, 'e': 0, 'i': 3, 'o': 2, 'u': 0}

# Question 3 

(15 points). The formula that describes the volume V of a sphere with radius r is the following:

$ V=\frac{4}{3}\ast\ \pi\ast\ r^3 $

Write a program to calculate the value of V when r is in the range of 1–10. Output the result in the following format:

	r	V
	1	…
	2	…
	3	…

In [41]:
# Your code here
print("r      V")
for r in range(1,11):


  print("{0}".format(r)," ",((4/3)*(22/7)*(r**3)))

r      V
1   4.19047619047619
2   33.52380952380952
3   113.14285714285712
4   268.19047619047615
5   523.8095238095237
6   905.142857142857
7   1437.333333333333
8   2145.523809523809
9   3054.857142857142
10   4190.47619047619

# Question 4

(40 points). In the field of Data Science, data is often formatted as a comma-delimited (CSV) file, where each line in a file corresponds to a field's value. Refer to Chapter 9 (p. 106) for more information on comma-delimited files. To answer this question, you will need to download the file [Assignment1_denton_housing.csv](https://github.com/unt-iialab/info5731-fall2021/blob/main/assignments/Assignment1_denton_housing.csv) included with this assignment. The file [Assignment1_denton_housing.csv](https://github.com/unt-iialab/info5731-fall2021/blob/main/assignments/Assignment1_denton_housing.csv) contains statistics about housing in the city of Denton from 2008 to 2014. Write a program to implement the following questions.

(1) (10 pts) Calculate the difference in the number of Occupied Housing Units from year to year and print it. The difference must be calculated for the consecutive years such as 2008-2009, 2009-2010 etc. Finally, print the values in the ascending order.

(2) (10 pts) For all the years, calculate the percentage of housing units which are vacant an occupied. Print the results in the following format:

Year Vacant Housing Units Occupied Housing Units

    2008  30%   70%                          
	2009 ----- -----
	2010 ----- -----
    2011 ----- -----
	2012 ----- -----
    2013 ----- -----
	2014 ----- -----
  
  

(3) (10 pts) Calculate and print the valued and years in which the highest number of housing units were vacant and occupied. Print the results in the following format:  

                              Year	Value
	Vacant Housing Units	  -----   -----
	Occupied Housing Units	-----   -----

(4) (10 pts) Calculate the harmonic mean of the total housing units and print it out. You can find the information about harmonic mean here: https://ncalculators.com/statistics/harmonic-mean-calculator.htm

In [54]:
pip install pyspark

Collecting pyspark
  Downloading pyspark-3.1.2.tar.gz (212.4 MB)
     |████████████████████████████████| 212.4 MB 62 kB/s
Collecting py4j==0.10.9
  Downloading py4j-0.10.9-py2.py3-none-any.whl (198 kB)
     |████████████████████████████████| 198 kB 56.7 MB/s
Building wheels for collected packages: pyspark
  Building wheel for pyspark (setup.py) ... done
  Created wheel for pyspark: filename=pyspark-3.1.2-py2.py3-none-any.whl size=212880768 sha256=6eea574205755650bb2db260d9b21fbed3ec708dcb2dbe5132dfdb76da2d08ea
  Stored in directory: /root/.cache/pip/wheels/a5/0a/c1/9561f6fecb759579a7d863dcd846daaa95f598744e71b02c77
Successfully built pyspark
Installing collected packages: py4j, pyspark
Successfully installed py4j-0.10.9 pyspark-3.1.2

In [67]:
from pyspark.sql import SparkSession
from pyspark.sql.functions import *
from pyspark.sql.window import Window

In [56]:
spark = SparkSession.builder.getOrCreate()

In [59]:
df = spark.read.csv("/content/Assignment1_denton_housing.csv",header=True)

In [60]:
df.show()

+----+--------------------+-----+
|year|         title_field|value|
+----+--------------------+-----+
|2014| Total Housing Units|49109|
|2014|Vacant Housing Units| 2814|
|2014|Occupied Housing ...|46295|
|2013| Total Housing Units|47888|
|2013|Vacant Housing Units| 4215|
|2013|Occupied Housing ...|43673|
|2012| Total Housing Units|45121|
|2012|Vacant Housing Units| 3013|
|2012|Occupied Housing ...|42108|
|2011| Total Housing Units|44917|
|2011|Vacant Housing Units| 4213|
|2011|Occupied Housing ...|40704|
|2010| Total Housing Units|44642|
|2010|Vacant Housing Units| 3635|
|2010|Occupied Housing ...|41007|
|2009| Total Housing Units|39499|
|2009|Vacant Housing Units| 3583|
|2009|Occupied Housing ...|35916|
|2008| Total Housing Units|41194|
|2008|Vacant Housing Units| 4483|
+----+--------------------+-----+
only showing top 20 rows

In [70]:
df_1 = df.where(col("title_field") =="Occupied Housing Units")

In [76]:
df_1.withColumn("lag_col",lag(col("value")).over(Window.orderBy("year")))\
  .withColumn("diff",col("value")-col("lag_col"))\
  .show()

+----+--------------------+-----+-------+------+
|year|         title_field|value|lag_col|  diff|
+----+--------------------+-----+-------+------+
|2008|Occupied Housing ...|36711|   null|  null|
|2009|Occupied Housing ...|35916|  36711|-795.0|
|2010|Occupied Housing ...|41007|  35916|5091.0|
|2011|Occupied Housing ...|40704|  41007|-303.0|
|2012|Occupied Housing ...|42108|  40704|1404.0|
|2013|Occupied Housing ...|43673|  42108|1565.0|
|2014|Occupied Housing ...|46295|  43673|2622.0|
+----+--------------------+-----+-------+------+

In [47]:
 # Your code here
import pandas as pd
df = pd.read_csv("/content/Assignment1_denton_housing.csv")

df.loc[df["title_field"] == "Occupied Housing Units"]

    year             title_field  value
2   2014  Occupied Housing Units  46295
5   2013  Occupied Housing Units  43673
8   2012  Occupied Housing Units  42108
11  2011  Occupied Housing Units  40704
14  2010  Occupied Housing Units  41007
17  2009  Occupied Housing Units  35916
20  2008  Occupied Housing Units  36711

In [51]:
df['Data_lead'] = df.loc[df["title_field"] == "Occupied Housing Units"].groupby(['title_field'])['value'].shift(-1)

In [53]:
df.loc[df["title_field"] == "Occupied Housing Units"].sort_values("year")

    year             title_field  value  Data_lead
20  2008  Occupied Housing Units  36711        NaN
17  2009  Occupied Housing Units  35916    36711.0
14  2010  Occupied Housing Units  41007    35916.0
11  2011  Occupied Housing Units  40704    41007.0
8   2012  Occupied Housing Units  42108    40704.0
5   2013  Occupied Housing Units  43673    42108.0
2   2014  Occupied Housing Units  46295    43673.0